app/Controllers/Client.php

		public function index () {
			$model = new ClientModel();
			return $this->getResponse ( [
				'message' => 'Clients retrieved successfully',
				'clients' => $model->findAll (),
			] );
---
SELECT *
FROM `client`